wolfSSL/Microchip/wolfboot-2.9.0-commercial/test-app/emu-test-apps/mcxw71/uart.c
/* uart.c
 *
 * Copyright (C) 2014-2026 wolfSSL Inc.  All rights reserved.
 *
 * This file is part of wolfBoot.
 *
 * Contact licensing@wolfssl.com with any questions or comments.
 *
 * https://www.wolfssl.com
 */

#include <stdint.h>
#include "fsl_device_registers.h"
#include "emu_app.h"

/* MRCC */
#define MRCC_BASE        0x4001C000u
#define MRCC_LPUART0     0xE0u

static inline void mrcc_enable(uint32_t off)
{
    volatile uint32_t *reg = (volatile uint32_t *)(MRCC_BASE + off);
    *reg = (1u << 31) | (1u << 30) | 1u;
}

/* LPUART0 */
#define LPUART0_BASE     0x40038000u
#define LPUART_STAT(b)   (*(volatile uint32_t *)((b) + 0x14u))
#define LPUART_CTRL(b)   (*(volatile uint32_t *)((b) + 0x18u))
#define LPUART_DATA(b)   (*(volatile uint32_t *)((b) + 0x1Cu))

#define LPUART_STAT_TDRE (1u << 23)
#define LPUART_STAT_RDRF (1u << 21)
#define LPUART_CTRL_RE   (1u << 18)
#define LPUART_CTRL_TE   (1u << 19)

void emu_uart_init(void)
{
    mrcc_enable(MRCC_LPUART0);
    LPUART_CTRL(LPUART0_BASE) = LPUART_CTRL_TE | LPUART_CTRL_RE;
}

void emu_uart_write(uint8_t c)
{
    while ((LPUART_STAT(LPUART0_BASE) & LPUART_STAT_TDRE) == 0u) {
    }
    LPUART_DATA(LPUART0_BASE) = (uint32_t)c;
}

int emu_uart_read(uint8_t *c)
{
    if ((LPUART_STAT(LPUART0_BASE) & LPUART_STAT_RDRF) == 0u) {
        return 0;
    }
    *c = (uint8_t)LPUART_DATA(LPUART0_BASE);
    return 1;
}
